Autodesk.Revit.DB.FabricationService.SetServiceGroupExclusions(System.Collections.Generic.IList{System.Int32})
This method is deprecated in Revit 2022 and may be removed in a future version of Revit.
Please use the `SetServicePaletteExclusions` method instead.
excludedGroups:
A list of service group indexes to be excluded.
Returns:
Returns true if succeeded to set the exclusions to the specified group(s).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
paletteIndices contains an index that is not larger or equal to 0 and less than PaletteCount
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.IsGroupExcluded(System.Int32)
This method is deprecated in Revit 2022 and and may be removed in a future version of Revit.
Please use the `IsPaletteExcluded` method instead.
groupIndex:
The index of the group.
Returns:
Returns true if the group indexed by groupIndex is currently to be excluded.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index groupIndex is not larger or equal to 0 and less than PaletteCount
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.GetGroupName(System.Int32)
This method is deprecated in Revit 2022 and may be removed in a future version of Revit.
Please use the `GetPaletteName` method instead.
group:
The index of the group.
Returns:
The name of the group.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index group is not larger or equal to 0 and less than PaletteCount
Since:
2016

Autodesk.Revit.DB.FabricationService.IsValidGroupIndex(System.Int32)
This method is deprecated in Revit 2022 and may be removed in a future version of Revit.
Please use the `IsValidPaletteIndex` method instead.
groupIndex:
The group index to check.
Returns:
True if larger or equal to 0 and less than GroupCount.
Since:
2016

Autodesk.Revit.DB.FabricationService.GroupCount
This method is deprecated in Revit 2022 and may be removed in a future version of Revit.
Please use the `PaletteCount` property instead.
Since:
2016